lib/tasks/import_playgrounds.rake

SELECT "playgrounds".* FROM "playgrounds" WHERE "playgrounds"."name" = 'Bishan-Ang Mo Kio Park Playground' LIMIT 1
INSERT INTO "playgrounds" ("name", "address", "description", "latitude", "longitude", "amenities", "age_group", "opening_hours", "contact_info", "created_at", "updated_at") VALUES ('Bishan-Ang Mo Kio Park Playground', '1384 Ang Mo Kio Ave 1, Singapore 569932', 'A large playground with multiple play areas for different age groups, featuring slides, swings, and climbing structures.', 1.3691, 103.8454, '["slides", "swings", "climbing structures", "sand pit", "water play area"]', '2-12 years', '24 hours', 'NParks Hotline: 1800-471-7300', '2025-07-02 02:51:22.287446', '2025-07-02 02:51:22.287446') RETURNING "id"
---
    ]

    sample_playgrounds.each do |playground_data|
      playground = Playground.find_or_initialize_by(name: playground_data[:name])
      playground.assign_attributes(playground_data)

      if playground.save